{
  "modelTopology": {
    "keras_version": "2.3.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": [
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 32,
            "kernel_size": [3, 3],
            "activation": "relu",
            "input_shape": [64, 64, 3]
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2]
          }
        },
        {
          "class_name": "Conv2D",
          "config": {
            "filters": 64,
            "kernel_size": [3, 3],
            "activation": "relu"
          }
        },
        {
          "class_name": "MaxPooling2D",
          "config": {
            "pool_size": [2, 2]
          }
        },
        {
          "class_name": "Flatten",
          "config": {}
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 128,
            "activation": "relu"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "sigmoid"
          }
        }
      ]
    },
    "weightsManifest": [
      {
        "paths": ["model_weights.bin"],
        "weights": [
          {
            "name": "conv2d/kernel",
            "shape": [3, 3, 3, 32]
          },
          {
            "name": "conv2d/bias",
            "shape": [32]
          },
          {
            "name": "conv2d_1/kernel",
            "shape": [3, 3, 32, 64]
          },
          {
            "name": "conv2d_1/bias",
            "shape": [64]
          },
          {
            "name": "dense/kernel",
            "shape": [4096, 128]
          },
          {
            "name": "dense/bias",
            "shape": [128]
          },
          {
            "name": "dense_1/kernel",
            "shape": [128, 1]
          },
          {
            "name": "dense_1/bias",
            "shape": [1]
          }
        ]
      }
    ]
  }
}